import './details.scss'
import StarRateIcon from '@mui/icons-material/StarRate';
import StarOutlineIcon from '@mui/icons-material/StarOutline';
export default function Details() {
    return (
        <>
        <div className="bgcolour">
            <div className="bgsqure">
              <div className="hedar">
              Venom (2005) සර්ප මිනිසෙකුගේ පළිගැනීම [සිංහල උපසිරැසි සමඟ]
              </div>
              <div className="filmThmbnil">
              <img src="https://i.ibb.co/FHShpGv/58-589476-official-venom-movie-poster.jpg" alt="58-589476-official-venom-movie-poster" border="0"/>
              </div>
              <div className="store">
                    කතාව ඔන්න අහගන්න… ඇමරිකාවේ ලුසියානා ප්‍රාන්තයේ වුන සිදුවීමක් විදිහට තමයි Venom (2005) කතාව ලියලා තියෙන්නේ… අතීත ඇමරිකාවේ අප්‍රිකානු සම්භවයක් ඇතිවෙලා තියනවා මේ අප්‍රිකානුවන්ගෙන් පැවතුණ හයිටි Voodoo ආගමේ පූජකවරියක් වන මැම්බෝ පරම්පරාවෙන් පැවතගෙන එන කෙනෙක් තමයි මේ කතාවේ ඉන්න එමී කියන කෙනා. එමී මේ කතාවෙ ඉන්න සීසීගෙ ආච්චි….. මේ ෆිල්ම් එක පටන් ගනිද්දි සිදුවීම් තුනක් එක දවසෙදි ඒ ගෙවෙන පැය කීපයතුල සිද්ද වෙනවා. (1) පළමු සිදුවීම තමා… එමී කියන වයසක ගැහැණු කෙනා කාර් එකක ඇවිත් වහින වෙලාවක රෑ කැළයක් ඇතුලෙ ඉඳන් වලදාලා තිබ්බ සූට්කේස් එකක් ගොඩට අරන් මන්තර වගයක් මතුරල ඒ සූට්කේස් එකත් කාර් එකේ දාගෙන වාහනෙත් එලවගෙන අවන්හල පැත්තට එනවා. (2) දෙවන සිදුවීම තමා… ඇබර්ක්‍රොම්බි කියන වෙළඳ සමාගම් පුරයට කිට්ටුව පුංචි Town එකක් තියනවා මේ ටවුන් එකේ Lee’s diner නමින් ලොකු බර්ගර් අවන්හලක් තියනවා. මේ අවන්හලෙන් තමා මුලු ටවුන් එකේම ඉන්න අය කන්න බොන්න එන්නේ..
                    මේ අවන් හලේ වැඩකරනවා ඊඩ්න්, රේචල්, සීසී කියන ලස්සන ගෑණු ළමයි තුන් දෙනෙක්.. කොහොම හරි එදා රෑ මේ ගෑණු ළමයි තුන් දෙනාගෙ අනිත් හොඳම යාළුවො පස් දෙනත් එනවා අවන්හලට රෑ කෑමට… එරික්, ෂෝන්, රිකී, පැටී, ටැමී තමයි ඒ අය.. මේ පස්දෙනාගෙන් එරික් මේ අවන්හලේ වැඩ කරන ඊඩ්න් ට Love… හැබැයි ඊඩ්න් උසස් අධ්‍යාපනය සඳහා කොලොම්බියාවට ඇප්ලයි කරල කියලා එරික්ට ආරංචි වෙනවා. ඊඩ්න් එහෙ ගියොත් එරික්ට ඊඩ්න්ව නැතිවෙයි කියන බයට තමයි මේ ගැන ඊඩ්න් එක්ක කොහොම හරි අද කතාකරනවා කියළා හිතාගෙන එරික් ඇවිත් තියෙන්නේ ? හරි… තුන්වන ප්‍රවේශයට එන්න කලින් මේ කතාවෙ තව චරිතයක් ගැන කියන්න ඕන.. ඒ තමයි රේ සෝයර්, මෙයා මේ ටවුන් එකේ ටිකක් එහා කැලේ පැත්තට වෙන්න Happy Time නමින් ඉන්ධන පිරවුම් හලක් කරගෙන යන කෙනෙක් මෙයාට ලොකූ Truck එකක් තියනවා. රේ.. මේ කතාවෙ ඉන්න ෂෝන් ගෙ තාත්තා.
                    <br/> <br/>
                    (3) තුන්වන සිදුවීම තමා… රේත් එනවා එදා මේ අවන්හලට එයාගෙ රෑ කෑම එක අරන් යන්න. ෂෝනුයි රේයි දෙන්න තරහයි (ඒක ඔයගොල්ලන්ට ෆිල්ම් එක බලනකොට තේරෙයි) රේ කෑම එක අරන් Truck එකත් එලවගෙන කැලේ පැත්තට යනවා (එමී කාර් එකෙන් අවන්හල පැත්තට එනවා, රේ කැලේ පැත්තට යනවා) ඉතින්.. රෑ 10 ට Lee’s diner එක වහල ඊඩ්න්, රේචල් දෙන්නත් ගෙවල්වලට යන්න යනවා.. මේ ටවුන් එකයි කැලෑවයි යාවෙන්නේ ලොකු පාලමකින් ඉතින් ඊඩ්න් බයිසිකල් එක පැදගෙන පාලම ලඟට එනකොටම එරික් මග රැකගෙන ඉඳලා ඊඩ්න් එක්ක ලොකු කතාවකට වැටෙනවා.. මේ අතරතුර රේගෙ ට්‍රක් එකත් එතනින් යනවා රේ චුට්ටක් විතර මේ දෙන්නත් එක්ක කතා කරලා පාලම මැදට හරියටම එනකොට. කැලේ පැත්තෙ ඉඳන් මම කිව්වනෙ එමී එනව කියළා.. කොහොමහරි දැන් පාලම මැදදි රේයි එමියි මුහුණට මූණ හැපෙන නිසා එමී කපනවා වාහනෙ ගඟ පැත්තට පාලම පොඩි නිසා එමීගෙ වාහනෙ පාලමෙ හිරවෙනවා එමීගෙ වාහනෙ ගඟට වැටෙන්න ඔන්න මෙන්න.. ඉතිං රේ, ඊඩ්න්, එරික්
                    මේ තුන් දෙනා හෙන ගේමක් දෙනවා එමීව බේරගන්න.. ඊඩ්න් අඳුන ගන්නවා මේ සීසීගෙ ආච්චි බව නමුත් කාර් එකෙන් එමීව එළියට ගන්නවා. එමී කියනවා කාර් එකේ තියන මගේ සූට්කේස් එකත් අරන් දෙන්න කියළා… ඒක ගන්න රේ කාර් එක ඇතුලට නගිනවාත් එක්කම කාර් එක ගඟට වැටෙනවා රේ කාර් එක ඇතුලෙනෙ කාර් එක ගඟේ ගිලෙනවා.. පස්සෙ එතනට ෂෙරිෆ් ටර්නර් ලොක්කත් එක්ක එනවා.. එතනට සීසීත් එනවා.. පහුවෙනිදා ඊඩ්න් ට ආරංචි වෙනවා ෂෙරිෆ් ටර්නර් ඇතුළු පිරිසක් අතුරුදහන් වුණු බව… මියගිය රේගෙ මළ සිරුරත් අතුරුදහන් වුණා කිව්වාම
                    ඊඩ්න් ටිකක් බයවෙනවා…????? ඔන්න ඔහොමයි මේ ෆිල්ම් එකේ ආරම්භය සනිටුහන් වෙන්නේ..!
              </div>

              <div className="trailerAndReating">
              <div class="video-container">
                <iframe
                    title="This is a unique title" 
                    src="//www.youtube.com/embed/vi9m0JRo71I?autoPlay=1"
                    width="680"
                    height="315"
                ></iframe>
                    <div className="desc">
                    <div className="director">
                    <div>Director</div>
                    <div className="subheder">Andy sarkis</div>
                    <div>Writer</div>
                    <div className="subheder">Jeff Pinkner(screenplay by)Scott Rosenberg(screenplay by)Kelly Marcel(screenplay by)</div>
                    <div>Stars</div>
                    <div className="subheder">Tom Hardy . Michelle williams . Riz Ahmed</div>
                    </div>
                    <div className="martRating">
                    <center>MAET Reting</center>
                    <center><div className="ratingIcons">
                       <StarRateIcon/><StarRateIcon/><StarRateIcon/><StarRateIcon/><StarOutlineIcon/>
                    </div></center>
                    <center><div className="reating">
                    5.0/4.1
                    </div>
                    </center>
                    </div>
                </div>
                </div>
                <div className="dawnlodtop">
                    Search google click කළ පසු හෑෂ් (hash) එක google හි සෙවුමක ලැබෙනු ඇත, එවිට ලැබෙන ඕනෑම ටොරන්ට් අඩවියකින් එම ටොරන්ට් එක බාගත කරගන්න
                    <div className="link">
                    Torrents Download
                    </div>
                    <img alt="google" src="https://baiscopedownloads.co/wp-content/uploads/2020/04/Search-Google-300x133.png"/>
                    </div>
              </div>
            </div>
        </div>
        </>
        
    )
}
